# Electrical System Other Conductors Number Property

Source: https://www.revitapidocs.com/2026/e08b1ded-65f8-4871-e3bb-a058f0b28a87.htm

---

| Electrical System Other Conductors Number Property |
| --- |

The OtherConductors Number of the Electrical System.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public int OtherConductorsNumber { get; }
```

```
Public ReadOnly Property OtherConductorsNumber As Integer
	Get
```

```
public:
property int OtherConductorsNumber {
	int get ();
}
```

```
member OtherConductorsNumber : int with get
```

#### Property Value

Int32 Exceptions

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

Remarks This property is used to retrieve the OtherConductors Number of the Electrical System. See Also

#### Reference

ElectricalSystem Class Autodesk.Revit.DB.Electrical Namespace